#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#include<time.h>

//给a=3，b=5，不使用额外的变量，交换两个数的值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("a:%d b:%d \n", a, b);
//
//	/*a = b % a;
//	b = b - a;
//	a = a + b;*/
//	//加减乘除的方法有可能会溢出 
//
//	a = a ^ b;//011^101=110
//	b = a ^ b;//110^101=011
//	a = a ^ b;//110^011=101
//	printf("a:%d b:%d \n", a, b);
//	return 0;
//}

//求一个整数在内存中的二进制中1的个数
//int main()
//{
//	int get = 0;
//	printf("输入一个数：");
//	scanf("%d", &get);
//	int i = 0;
//	int count = 0;
//	for (i = 0; i <= 31; i++)
//	{
//		int x = get >> i;
//		if (x & 1 == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d在内存中的二进制中有%d个1", get, count);
//	return 0;
//}

//int main()
//{
//	int a = 5;//将a的二进制从右往左第五位置1
//	a = a | (1 << 4);
//	//1<<4:  00000000 00000000 00000000 00010000
//	//a:     00000000 00000000 00000000 00000101
//	//a|1<<4:00000000 00000000 00000000 00010101
//	//|:按位或，只要对应位有1，得到的结果就是1
//	printf("%d\t", a);
//	//将a的二进制从右往左第五位置0
//	a = a & ~(1 << 4);
//	//1<<4:		  00000000 00000000 00000000 00010000
//	//~(1<<4):	  11111111 11111111 11111111 11101111
//	//a:		  00000000 00000000 00000000 00010101
//	//a&a~(1<<4): 00000000 00000000 00000000 00000101
//	//对应位只要有0，按位与得到的结果就是0，只有两个对应位都为1，得到的结果才是1
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//当&&遇到第一个0的时候，后面就不再计算了
//	i = a++ || ++b || d++;//当||遇到第一个为真的时候，就不在往后算了
//	printf("a:%d\tb:%d\tc:%d\td:%d\t", a, b, c, d);
//	return 0;
//}

int main()
{
	int a = 3;
	int b = 4;
	int c = 9;
	int d = (c = 9, a = b + c, b = c - a, c = 8);
	//逗号表达式要从做向右依次计算，但整个表达式的结果是最后一个表达式的结果
	//首先c=9，然后a=b+c为12，接着b=c-a为9，最后给c赋值8，d得到的是表达式最后一个结果，即c=8
	printf("d:%d\n", d);
	return 0;
}